emacs/.emacs.d/libs/zettelkasten.org
#+TITLE: Org-Roam, References and the Zettelkasten Workflow

This file is a core part of my emacs configuration and is all about my Org-roam setup and my reference management inside org. Its based on the Zettelkasten method and the Roam Research website. Notes are linked with one another. Bibtex completion (and the existence of .bib files in general) as well as Org-ref help manage bibliographic references inside org. I also use Zotero as it easily allows me to gather my bibliographies. It exports a .bib file which these two use. Org Roam Bibtex (ORB) is a package that combines all of these to help you add citation links from org-ref inside an org-roam buffer. This section includes all the customisations and settings of these packages. This is a very large section of my config (hence why it has its own file) as I have really customised this workflow a lot. 

* Table of Contents                                                     :TOC:
- [[#org-roam-general-setup][Org-Roam general setup]]
- [[#useful-functions][Useful Functions]]
- [[#acting-on-backlinks][Acting on backlinks]]
- [[#bibtex-completion-ivy-and-org-ref][Bibtex completion (Ivy) and Org-Ref]]
- [[#org-roam-bibtex-protocols-reference-notes-and-ui-graphing-capabilities][Org Roam Bibtex, Protocols (Reference notes) and UI (graphing capabilities)]]
- [[#fleeting-notes][Fleeting notes]]
- [[#capture-templates][Capture Templates]]
- [[#implementing-the-zettelkasten-desktop-to-org-roam][Implementing the Zettelkasten "desktop" to org-roam]]
  - [[#dependencies][Dependencies]]
  - [[#predicate-functions][Predicate Functions]]
  - [[#adding-and-removing-things-in-the-zetteldesk][Adding and Removing things in the Zetteldesk]]
  - [[#filter-functions][Filter functions]]
  - [[#on-the-zetteldesk-scratch-buffer][On the zetteldesk-scratch buffer]]
  - [[#providing-the-package][Providing the package]]
- [[#providing-the-package-to-be-loaded-in-initel][Providing the package to be loaded in init.el]]

* Org-Roam general setup
  This part is the general setup of org-roam. It contains the setup, removing the warning message for the migration to v2, and the use-package declaration for org-roam. There I put the org roam directory, the various defmethods I use, my display template and a resize to the org-roam buffer as taking half the screen isn't something I like. I much prefer it to be a bit smaller than the main window.

  A lot of the defmethods defined here are for my display template as I think its useful to see directories, backlink count and todo state of nodes in the org-roam-node-find UI. Then there is the oddball org-roam-node-backlinkscount-number which is identical almosy to org-roam-node-backlinkscount, but its different output is useful for a function I define later and the org-roam-node-buffer defmethod which is a very helpful defmethod that imo should have been defined in org-roam. It returns the buffer associated to a node, and nil if there is none. I use this in various parts of my config and I consider it an important defmethod. 
   
 #+BEGIN_SRC elisp :tangle yes

   (add-hook 'after-init-hook 'org-roam-setup)
   (setq org-roam-v2-ack t)

   (use-package org-roam
     :config
     (setq org-roam-directory "~/org_roam/"
	   org-roam-dailies-directory "~/org_roam/daily")

     (cl-defmethod org-roam-node-directories ((node org-roam-node))
       "Access slot \"directory\" of org-roam-node struct CL-X"
       (if-let ((dirs (file-name-directory (file-relative-name (org-roam-node-file node) org-roam-directory))))
	   (format "(%s)" (car (f-split dirs)))
	 ""))

     (cl-defmethod org-roam-node-backlinkscount ((node org-roam-node))
       "Access slot \"backlinks\" of org-roam-node struct CL-X"
       (let* ((count (caar (org-roam-db-query
			    [:select (funcall count source)
				     :from links
				     :where (= dest $s1)
				     :and (= type "id")]
			    (org-roam-node-id node)))))
	 (format "[%d]" count)))

     (cl-defmethod org-roam-node-backlinkscount-number ((node org-roam-node))
       "Access slot \"backlinks\" of org-roam-node struct CL-X. This
       is identical to `org-roam-node-backlinkscount' with the
       difference that it returns a number instead of a fromatted
       string. This is to be used in
       `org-roam-node-sort-by-backlinks'"
       (let* ((count (caar (org-roam-db-query
			    [:select (funcall count source)
				     :from links
				     :where (= dest $s1)
				     :and (= type "id")]
			    (org-roam-node-id node)))))
	 count))

     (cl-defmethod org-roam-node-todostate ((node org-roam-node))
       "Modified version of org-roam-node-todo to look a bit better"
       (if-let ((state (org-roam-node-todo node)))
	   (format "Status: %s" state)))

     (cl-defmethod org-roam-node-buffer ((node org-roam-node))
       "Access slot \"buffer\" of org-roam-node struct CL-X"
       (let ((buffer (get-file-buffer (org-roam-node-file node))))
	 buffer))

     (setq org-roam-node-display-template "${title:100} ${backlinkscount:6} ${todostate:20} ${directories:10} ${tags:25}")

     (add-to-list 'display-buffer-alist
		  '("\\*org-roam\\*"
		    (display-buffer-in-direction)
		    (direction . right)
		    (window-width . 0.40)
		    (window-height . fit-window-to-buffer))))

   #+END_SRC

* Useful Functions
   Org roam is a cornerstone of my workflow (which is the reason this file is so stupidly large). I have written various "helper" functions for my own assistance that are meant to be used with org-roam. This section includes those functions. They are all documented well so I do not think I need to describe them. 

#+BEGIN_SRC elisp :tangle yes

  (defun org-roam-buffer-without-latex ()
      "Essentially `org-roam-buffer-toggle' but it ensures latex previews are turned off before toggling the buffer.

    This is useful because especially with index files, having
    latex previews on, makes opening the buffer very slow as it
    needs to load previews of many files. If you by default have
    `org-startup-with-latex-preview' set to t, you have probably
    noticed this issue before. This function solves it."
      (interactive)
      (let ((org-startup-with-latex-preview nil))
	(org-roam-buffer-toggle)))

  (defun org-roam-permanent-note-p (NODE)
    "Check if NODE is at the top level org_roam directory using the
    `org-roam-node-directories' function. If it isn't,
    `org-roam-node-directories' will return a non empty string,
    therefore this expression will evaluate to nil. The way my
    notes are sorted, when a note is placed on the top level its a
    permanent note, while fleeting and reference notes are placed
    in subdirectories.

  Therefore, this predicate function allows me to create a version
  of `org-roam-node-find' which only shows my permanent notes,
  which can be useful in some cases. That filtered function is
  `org-roam-find-permanent-node'."
    (string-equal (org-roam-node-directories NODE) ""))

  (defun org-roam-node-poi-or-moc-p (NODE)
    "Check if NODE has the tag POI or the tag MOC. Return t if it does"
    (or (string-equal (car (org-roam-node-tags NODE)) "POI")
	(string-equal (car (org-roam-node-tags NODE)) "MOC")))

  (defun org-roam-find-permanent-node ()
    "Execute `org-roam-node-find' with the list being filtered to
  only include permanent notes. In my system that is synonymous to
  saying include only notes at the top level directory. The
  filtering is done with the `org-roam-permanent-note-p' predicate
  function."
    (interactive)
    (org-roam-node-find nil nil #'org-roam-permanent-note-p))
#+END_SRC

* Acting on backlinks
  Backlinks are a pivotal part of this workflow. A file has a backlink if another file links to it. As a core part of my workflow revolves around index files (or Maps of Contents) and those are files that basically everything connected to that subject links to them, they end up being files with a lot of backlinks. I have some functions here that act on backlinks which I consider useful. Excluded from this list are two defmethods I use concerning backlinks as I define all my defmethods in the first part of the config.

  The first is org-roam-node-backlinkscount, a function I initially found on the OR wiki on github, which finds the number of backlinks a note has and formats them in a nice string. Its meant to be used with org-roam-node-display-template to show the number of backlinks in the org-roam-node-UI. The second is an almost identical function, but instead of returning a formatted string it returns a number. That is meant to be used with org-roam-node-sort-by-backlinks, a function defined below which sorts nodes by the number of backlinks they have. Number comparison is much easier than comparison of string representing numbers, and due to the extra formatting applied (which I like for the purpose that function has) I couldn't find how to convert that string to a number so I just made a rewrite with that small change.  

  #+BEGIN_SRC elisp :tangle yes

    (defvar-local org-roam-backlinks nil
      "Buffer local variable displaying a list of the absolute paths
      of all the files that are backlinked to current node. These are
      not added by default, and as such this variable has the value
      nil but they can be added by running the
      `org-roam-backlink-files' function on a node.")

    (defvar org-roam-backlink-pdfs nil
      "After running `org-roam-export-backlinks-to-latex-pdf', to
      export a node and all its backlinks to pdf, the value of this
      variable in the original node's buffer will become a list of
      all the pdfs that were created. This is to ease the process of
      combining them as the value of this variable can then be passed
      to a program such as pdftk to combine them.")

    (defun org-roam-node-sort-by-backlinks (completion-a completion-b)
      "Sorting function for org-roam that sorts the list of nodes by
    the number of backlinks. This is the sorting function in
    `org-roam-node-find-by-backlinks'"
      (let ((node-a (cdr completion-a))
	    (node-b (cdr completion-b)))
	(>= (org-roam-node-backlinkscount-number node-a)
	    (org-roam-node-backlinkscount-number node-b))))

    (defun org-roam-node-find-by-backlinks ()
      "Essentially works like `org-roam-node-find' (although it uses
    a combination of `find-file' and `org-roam-node-read' to
    accomplish that and not `org-roam-node-find' as only
    `org-roam-node-read' can take a sorting function as an argument)
    but the list of nodes is sorted by the number of backlinks
    instead of most recent nodes. Sorting is done with
    `org-roam-node-sort-by-backlinks'"
      (interactive)
      (find-file (org-roam-node-file (org-roam-node-read nil nil #'org-roam-node-sort-by-backlinks))))

    (defun org-roam-backlink-query ()
      "Simple org-roam query function that stores the IDs of all the
      files that link to the node at point. This is a modified part
      of the `org-roam-backlinks-get' function keeping only the part
      necessary for `org-roam-backlink-files' to work as this is a
      complimentary function to that"
      (org-roam-db-query
       [:select [source dest]
		:from links
		:where (= dest $s1)
		:and (= type "id")]
       (org-roam-node-id (org-roam-node-at-point))))

    (defun org-roam-backlink-files ()
	"Get all nodes that link to the node at point with the
	`org-roam-backlink-query' function, find their absolute path
	and save a list of those paths to the buffer local variable
	`org-roam-backlinks'.

      With the list, you can act on all those files together. This is
      exceptionally useful with index files as it allows you to do an
      action on all files linked to this index automatically."
	(interactive)
	(let ((backlinks (length (org-roam-backlink-query))))
	  (dotimes (number backlinks)
	    (let* ((id (car (nth number (org-roam-backlink-query))))
		   (node (org-roam-node-from-id id)))
	      (setq-local org-roam-backlinks (cons (org-roam-node-file node) org-roam-backlinks))))
	  org-roam-backlinks))

    (defun org-roam-export-backlinks-to-latex-pdf ()
      "Export the current buffer and every buffer that mentions it to
    a pdf through the org-latex export. Makes use of the
    `org-roam-backlink-files' function to find all the
    backlinks. Also saves all the pdf names in a variable called
    `org-roam-backlink-pdfs'. These names can then be passed to
    something like pdftk to merge them into one pdf"
      (interactive)
      (save-current-buffer
	(let ((backlinks (cons (buffer-file-name) org-roam-backlinks))
	      (org-startup-with-latex-preview nil))
	  (while backlinks
	    (find-file (car backlinks))
	    (org-latex-export-to-pdf)
	    (setq org-roam-backlink-pdfs
		  (cons (concat (file-name-sans-extension (car backlinks)) ".pdf") org-roam-backlink-pdfs))
	    (setq backlinks (cdr backlinks)))))
      (message "%s" "Done!"))

  #+END_SRC
  
* Bibtex completion (Ivy) and Org-Ref
  Ivy Bibtex and Org ref are two excellent packages for managing bibliography. The main thing I need to configure is the location of my master .bib file and pdfs (which are exported with Zotero). I also change some other variables where I see fit.
   
  In detail
  - Zotero exports a .bib file with all my references (the main way it "talks" to Emacs). I "tell" ivy-bibtex and org-ref the location of this file for usage in their various commands.
  - I allow ivy-bibtex to query by keywords or abstract. Can be useful
  - I make the default action of ivy-bibtex, the edit notes action. Personally, its the action I use most as opening the link/pdf to the reference (which is the original default) is more easily done from Zotero imo. In Emacs I find more utility in this function creating bibliographical notes.
  - Since opening the pdf, url or DOI of a bibtex entry is no longer the default action in my config, I bind it to the letter p in the options menu of Ivy-bibtex
  - Change the citation format bibtex uses on org mode. I enter cite links with org-ref-insert-cite-links so I make the ivy-bibtex link be a link to the pdf.

     #+BEGIN_SRC elisp :tangle yes
       (setq bibtex-completion-bibliography
	     '("~/Sync/My_Library.bib" "~/Sync/My_Library2.bib")
	     bibtex-completion-pdf-field "File"
	     bibtex-completion-library-path '("~/Sync/Zotero_pdfs"))
	
       (setq bibtex-completion-additional-search-fields '(keywords abstract))
	
       (setq ivy-bibtex-default-action 'ivy-bibtex-edit-notes)
       (ivy-add-actions
	'ivy-bibtex
	'(("p" ivy-bibtex-open-any "Open pdf, url or DOI")))
	
       (setq bibtex-completion-format-citation-functions
	     '((org-mode . bibtex-completion-format-citation-org-title-link-to-PDF)
	       (latex-mode . bibtex-completion-format-citation-cite)
	       (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc)
	       (python-mode . bibtex-completion-format-citation-sphinxcontrib-bibtex)
	       (rst-mode . bibtex-completion-format-citation-sphinxcontrib-bibtex)
	       (default . bibtex-completion-format-citation-default)))
    #+END_SRC

