emacs/.emacs.d/libs/zettelkasten.org
** Org-remark integration
   Org-remark is a package for highlighting parts of a document and creating marginal notes from them. I believe that such a feature is great for an environment such as the zetteldesk-scratch buffer. But as that buffer is not associated to a file, I want to setup better integration between it and zetteldesk.

   Namely, I am mostly looking for two things to work as I want them. Be able to create margin notes from the zetteldesk-scratch buffer without it being associated to a file, by let-binding the value of ~org-remark-notes-file-name~ to an absolute path, probably of the form of org-roam-directory/zetteldesk-margin-notes.org or something. Then, if I decide I want to save this zetteldesk to a file, the margin-notes should be linked there correctly (might happen by default, however I am uncertain).

   Furthermore, I want to make sure the behaviour is as intended when having multiple margin notes from zetteldesks. This heading will tangle to a seperate file which will be a zetteldesk extension.

   #+BEGIN_SRC elisp :tangle zetteldesk-remark.el

     (defun zetteldesk-remark-mark (beg end)
       "Wrapper for `org-remark-mark'.

     Calls the function with `org-remark-notes-file-name' being set to
     zetteldesk-margin-notes.org in the `org-roam-directory'"
       (interactive (org-remark-region-or-word))
       (let ((org-remark-notes-file-name
	      (concat org-roam-directory "zetteldesk-margin-notes.org")))
	 (org-remark-mark beg end)))

     (defun zetteldesk-remark-highlight-advice
	 (beg end &optional id mode label face properties)
       "Advice function to be used with `org-remark-highlight-mark'.

     If the current buffer isn't associated to a file, find the
     heading's title, associate it with an org-roam-node and find the
     file associated with that node. Then run the part of
     `org-remark-highlight-save' that wasn't ran if the buffer isn't
     associated with a file. This part is a call to
     `org-remark-highlight-save'.

     This is meant to be used when taking margin notes from the
     ,*zetteldesk-scratch* buffer. However, this will only work if the
     current heading's title is associated with a node. In this case
     org-remark will be able to associate the margin note with the
     node its related to."
       (unless buffer-file-name
	 (let* ((title (org-entry-get nil "ITEM"))
		(node (org-roam-node-from-title-or-alias title))
		(file (org-roam-node-file node))
		(ov (make-overlay beg end nil :front-advance)))
	   (org-remark-highlight-save file
				      beg end
				      (overlay-properties ov)
				      title))))

     (advice-add 'org-remark-highlight-mark :after #'zetteldesk-remark-highlight-advice)

     (defun zetteldesk-switch-to-margin-notes ()
       "Helper function which goes to the zetteldesk-margin-notes file.

     If `org-remark-mark' is called through its wrapper function
     `zetteldesk-remark-mark', it sets `org-remark-notes-file-name' to
     a specific file, which is meant to be used with all margin notes
     coming from zetteldesk-scratch. This function switches to that
     file."
       (interactive)
       (pop-to-buffer (find-file (concat org-roam-directory "zetteldesk-margin-notes.org"))))

   #+END_SRC
     
** Handling notes on articles better
   This section is about zetteldesk-ref, an optional extension of zetteldesk.el. It includes integrationof the zetteldesk with various reference sources such as bibtex entry nodes, which are org-roam nodes, however they need a different behaviour than your typical org-roam node. It also include the info stuff as I decided to make that optional.

*** Preamble
    This is just the intro text that needs to be in the start of the file

    #+BEGIN_SRC elisp :tangle zetteldesk-ref.el
      ;;; zetteldesk-ref.el --- A zetteldesk extension for use with the Info
      ;;; program and literature nodes

      ;; Author: Vidianos Giannitsis <vidianosgiannitsis@gmail.com>
      ;; Maintaner: Vidianos Giannitsis <vidianosgiannitsis@gmail.com>
      ;; URL: https://github.com/Vidianos-Giannitsis/zetteldesk-ref.el
      ;; Package-Requires: ((zetteldesk "0.2") (bibtex-completion))
      ;; Created: 27th March 2022
      ;; License: GPL-3.0

      ;; This file is free software; you can redistribute it and/or modify
      ;; it under the terms of the GNU General Public License as published by
      ;; the Free Software Foundation; either version 3, or (at your option)
      ;; any later version.

      ;; This program is distributed in the hope that it will be useful,
      ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
      ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
      ;; GNU General Public License for more details.

      ;; For a full copy of the GNU General Public License
      ;; see <https://www.gnu.org/licenses/>.

      ;;; Commentary:

      ;; This package provides some optional improvements to
      ;; zetteldesk.el. Specifically it introduces mechanisms for handling
      ;; nodes from the Info program built in to emacs and literature notes
      ;; associated to a bibtex entry which are mostly powered by
      ;; org-noter. This code makes these reference materials interface
      ;; better with the zetteldesk.

      ;;; Code:

    #+END_SRC
    
*** Reference notes from Bibtex Entries
    I have a decent amount of notes that are on scientific articles taken with ~org-noter~. These are org-roam nodes, but they need a special behaviour imo as their formatting isn't similar to that of my permanent notes. Now, gathering these nodes to make a special filter function including only those was an adventure in and of itself. But it was a chance to get more familiarized with common lisp loops, which are a very powerful system.

   #+BEGIN_SRC elisp :tangle zetteldesk-ref.el

     ;; -- Reference Nodes from Bibtex Entries --
     (defun zetteldesk-note-refs-p ()
       "Predicate function that finds all bibtex completion candidates with a note.

     Checks if every candidate has the \"=has-note=\" tag using
     `assoc' and if it does, collects that candidate"
       (cl-loop for ref in (bibtex-completion-candidates)
		if (assoc "=has-note=" ref)
		collect ref))

     (defun zetteldesk-citekey-from-refs ()
       "Function that finds the \"=key=\" tag from a list of candidates.

     The list is collected with `zetteldesk-note-refs-p' which is a
     list of candidates that have notes. Collects it using `assoc'."
       (cl-loop for ref in (zetteldesk-note-refs-p)
		collect (assoc "=key=" ref)))

     (defun zetteldesk-node-from-refs ()
       "Function that collects a list of ref nodes.

     The nodes are collected from their citekey using
     `org-roam-node-from-ref', while the citekeys themselves are
     collected from `zetteldesk-citekey-from-refs'."
       (cl-loop for ref in (zetteldesk-citekey-from-refs)
		collect (org-roam-node-from-ref (concat "cite:" (cdr ref)))))

     (defun org-roam-node-read--completions* (node-list &optional filter-fn sort-fn)
       "Runs `org-roam-node-read--completions' with NODE-LIST being a list of nodes.

     Typically, the function takes `org-roam-node-list' as the initial
     list of nodes and creates the alist `org-roam-node-read'
     uses. However, it can be helpful to supply the list of nodes
     yourself, when the predicate function used cannot be inferred
     through a filter function of the form this function
     takes. FILTER-FN and SORT-FN are the same as in
     `org-roam-node-read--completions'. The resulting alist is to be
     used with `org-roam-node-read*'."
       (let* ((template (org-roam-node--process-display-format org-roam-node-display-template))
	      (nodes node-list)
	      (nodes (mapcar (lambda (node)
			       (org-roam-node-read--to-candidate node template)) nodes))
	      (nodes (if filter-fn
			 (cl-remove-if-not
			  (lambda (n) (funcall filter-fn (cdr n)))
			  nodes)
		       nodes))
	      (sort-fn (or sort-fn
			   (when org-roam-node-default-sort
			     (intern (concat "org-roam-node-read-sort-by-"
					     (symbol-name org-roam-node-default-sort))))))
	      (nodes (if sort-fn (seq-sort sort-fn nodes)
		       nodes)))
	 nodes))

     (defun org-roam-node-read* (node-list &optional initial-input filter-fn sort-fn require-match prompt)
       "Runs `org-roam-node-read' with the nodes supplied by NODE-LIST.

     NODE-LIST is a list of nodes passed to
     `org-roam-node-read--completions*', which creates an alist of
     nodes with the proper formatting to be used in this
     function. This is for those cases where it is helpful to use your
     own list of nodes, because a predicate function can not filter
     them in the way you want easily."
       (let* ((nodes (org-roam-node-read--completions* node-list filter-fn sort-fn))
	      (prompt (or prompt "Node: "))
	      (node (completing-read
		     prompt
		     (lambda (string pred action)
		       (if (eq action 'metadata)
			   `(metadata
			     ;; Preserve sorting in the completion UI if a sort-fn is used
			     ,@(when sort-fn
				 '((display-sort-function . identity)
				   (cycle-sort-function . identity)))
			     (annotation-function
			      . ,(lambda (title)
				   (funcall org-roam-node-annotation-function
					    (get-text-property 0 'node title))))
			     (category . org-roam-node))
			 (complete-with-action action nodes string pred)))
		     nil require-match initial-input 'org-roam-node-history)))
	 (or (cdr (assoc node nodes))
	     (org-roam-node-create :title node))))

     (defun zetteldesk-find-ref-node ()
       "Execute a filtered version of `ivy-bibtex-with-notes'.

     This does not exactly run `ivy-bibtex-with-notes' as that doesn't
     have a way to filter things. It collects a list of nodes which
     are reference nodes linked to a bibtex entry through
     `zetteldesk-node-from-refs' and passes it to
     `org-roam-node-read*' which is a modified version of
     `org-roam-node-read' which takes a list of nodes as an
     argument. Since this required a rewrite of `org-roam-node-read',
     finding the file is done indirectly and not through
     `org-roam-node-file'."
       (interactive)
       (find-file (org-roam-node-file (org-roam-node-read* (zetteldesk-node-from-refs) nil #'zetteldesk-node-p))))

     (defun zetteldesk-insert-ref-node-contents (&optional arg)
       "Select a node that is part of the current `zetteldesk' and a ref node.
     Ref nodes are nodes that refer to reference material such as an
     article. These are gathered with `zetteldesk-node-from-refs' and
     shown to the user through `org-roam-node-read*' filtered
     according to `zetteldesk-node-p'.

     After selection, insert its citekey at point for future
     reference, then in the location determined by
     `zetteldesk-insert-location' (typically *zetteldesk-scratch*), go
     to `point-max', insert a newline and then insert the contents of
     the selected node but remove the first 4 lines which is the
     unneeded property drawer. After, indent all headings by one level
     and replace the #+title: with an asterisk. Finally, enter a
     newline after the title, where the string \"Bibtex entry for
     node: \" is entered suffixed by the citekey of the entry.

     If given the optional argument ARG, which needs to be the
     `\\[universal-argument]' also switch to the *zetteldesk-scratch*
     buffer in a split."
       (interactive "P")
       (let* ((node
	       (org-roam-node-read* (zetteldesk-node-from-refs) nil #'zetteldesk-node-p))
	      (file (org-roam-node-file node))
	      (location (zetteldesk-insert-location))
	      (citekey (concat "cite:" (car (org-roam-node-refs node)))))
	 (insert citekey)
	 (set-buffer location)
	 (goto-char (point-max))
	 (save-excursion
	   (insert-file-contents file))
	 (kill-whole-line 4)
	 (newline)
	 (save-excursion
	   (while (not (org-next-visible-heading 1))
	     (org-metaright)))
	 (replace-string "#+title: " "* ")
	 (end-of-line 1)
	 (newline)
	 (insert "Bibtex entry for node: "
		 citekey))
       (zetteldesk-insert-switch-to-scratch arg))

   #+END_SRC

